/*
  初始化矩阵a[4][4]={{4,7,2,1},{5,2,9,0},{6,8,1,7},{4,6,2,3}}，从键盘输入n，将矩阵中所有小于n值的元素设置为-1，输出结果矩阵。
  
  【样例输入】
  
  3
  
  【样例输出】
  
  4 7 -1 -1
  
  5 -1 9 -1
  
  6 8 -1 7
  
  4 6 -1 3
 */

#include<stdio.h>

int main(){
	int a[4][4]={{4,7,2,1},{5,2,9,0},{6,8,1,7},{4,6,2,3}};
	int n;
	scanf("%d", &n);
	for(int i=0; i<4; i++){
		for(int j=0; j<4; j++){
			if(a[i][j] < n){
				a[i][j] = -1;
			}
		}
	}
	for(int i=0; i<4; i++){
		for(int j=0; j<4; j++){
			printf("%d ", a[i][j]);
		}
		printf("\n");
	}
	
}
